snlkuharlocal/src/Documents/НачислениеАмортизации/НачислениеАмортизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеАмортизации</name>
  <registerRecords>AccumulationRegister.Затраты</registerRecords>
  <registerRecords>AccumulationRegister.Амортизация</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Амортизация</name>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/AccumulationRegisters/Амортизация/Амортизация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Амортизация</name>
  <resources>
    <name>Амортизация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОС</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/InformationRegisters/СостояниеОС/СостояниеОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеОС</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ДатаВводаВЭксплуатацию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокПолезногоИспользования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </resources>
  <resources>
    <name>НачислятьАмортизацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НачислятьИзнос</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Выбыло</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОС</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/AccumulationRegisters/Затраты/Затраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Затраты</name>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасходов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентЛогистика</name>
    <type>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналСбыта</name>
    <type>
      <types>CatalogRef.КаналСбыта</types>
    </type>
  </attributes>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КапитальныеЗатраты</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СубЗатрата</name>
    <type>
      <types>CatalogRef.СубЗатраты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Enums/ВидыНоменклаутры/ВидыНоменклаутры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНоменклаутры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>ОсновноеСредство</name>
  </enumValues>
  <enumValues>
    <name>МБП</name>
  </enumValues>
  <enumValues>
    <name>Материал</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификат</name>
  </enumValues>
  <enumValues>
    <name>КомпьютернаяТехника</name>
  </enumValues>
  <enumValues>
    <name>РекламаПлатная</name>
  </enumValues>
  <enumValues>
    <name>РекламаБесплатная</name>
  </enumValues>
  <enumValues>
    <name>Упаковка</name>
  </enumValues>
  <enumValues>
    <name>ТМЦнаОтветственномХранении</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/НачислениеАмортизации/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	Запрос=Новый Запрос;
	Запрос.МенеджерВременныхТаблиц=Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Ссылка КАК ОС
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ ЭтоГруппа
	|	И Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.ОсновноеСредство)";
	
	МассивОС=Новый Массив;
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл		
		МассивОС.Добавить(Выборка.ОС);	
	КонецЦикла; 
	
	Запрос.Текст="	
	|ВЫБРАТЬ 
	|	Склад,
	|	ОС,
	|	СУММА(Балансовая) КАК Балансовая,
	|	СУММА(Амортизация) КАК Амортизация,
	|	СУММА(Балансовая)-СУММА(Амортизация) КАК Остаточная	
	|ПОМЕСТИТЬ ОстаткиОС
	|ИЗ
	|(		
	|ВЫБРАТЬ
	|	Склад,
	|	Номенклатура КАК ОС,
	|	СуммаОстаток КАК Балансовая,
	|	0 КАК Амортизация	
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(&Дата1, Номенклатура В (&МассивОС))
	|ГДЕ
	|	НЕ Склад.НеНачислятьАмортизацию
	|ОБЪЕДИНИТЬ ВСЕ
	|	ВЫБРАТЬ
	|	Склад,
	|	ОС,
	|	0,
	|   АмортизацияОстаток КАК Амортизация
	|ИЗ
	|	РегистрНакопления.Амортизация.Остатки(&Дата1)
	|) КАК Сводный
	|СГРУППИРОВАТЬ ПО 
	|	Склад,ОС";
			
	Запрос.УстановитьПараметр("Дата1",КонецМесяца(Дата));
	Запрос.УстановитьПараметр("МассивОС",МассивОС);
	Запрос.Выполнить();
	
	Запрос.Текст="
	|ВЫБРАТЬ	
	|	ОстаткиОС.Склад КАК Склад,
	|	ОстаткиОС.Склад.Подразделение КАК Подразделение,
	|	ОстаткиОС.ОС КАК ОС,
	|	ОстаткиОС.Балансовая КАК Балансовая,
	|	ОстаткиОС.Амортизация КАК Амортизация,
	|	ОстаткиОС.Остаточная КАК Остаточная,		
	|	СтатьяЗатрат,
	|	IsNull(НачислятьАмортизацию,Ложь)		КАК НачислятьАмортизацию,
	|	IsNull(НачислятьИзнос,Ложь)				КАК НачислятьИзнос,
	|	IsNull(Выбыло,Ложь)						КАК Выбыло,
	|	IsNull(СрокПолезногоИспользования,0)	КАК СрокПолезногоИспользования
	|ИЗ
	|	ОстаткиОС
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СостояниеОС.СрезПоследних(&Дата1) КАК СостояниеОС
	|ПО 
	|	ОстаткиОС.ОС=СостояниеОС.ОС";
	
	Выборка=Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		Если НЕ (Выборка.НачислятьАмортизацию ИЛИ Выборка.НачислятьИзнос) Тогда Продолжить КонецЕсли; 
		Если Выборка.Остаточная<=0 Тогда Продолжить КонецЕсли;
		Если Выборка.Выбыло Тогда Продолжить КонецЕсли;
		
		Если Выборка.СрокПолезногоИспользования=0 Тогда 
			Сообщить("По ОС: инв. №: """+Выборка.ОС.Код+""" не указан срок полезного использования !",СтатусСообщения.Важное);
			Продолжить; 
		КонецЕсли; 
		
		Если Выборка.НачислятьАмортизацию Тогда
			РасчетнаяАмортизация=Выборка.Балансовая/Выборка.СрокПолезногоИспользования		
		Иначе
			Если Месяц(Дата)=12 Тогда   //Износ начисляется раз в год
				РасчетнаяАмортизация=12*Выборка.Балансовая/Выборка.СрокПолезногоИспользования						
			Иначе
				РасчетнаяАмортизация=0;		
			КонецЕсли;		
		КонецЕсли; 
		
		РасчетнаяАмортизация=Мин(РасчетнаяАмортизация,Выборка.Остаточная);		
		Если РасчетнаяАмортизация>0 Тогда		
			Движение=Движения.Амортизация.Добавить();
			
			Движение.Период=Дата;
			Движение.ВидДвижения	=ВидДвиженияНакопления.Приход;
			
			Движение.Склад			=Выборка.Склад;
			Движение.ОС				=Выборка.ОС;
			
			Движение.Амортизация	=РасчетнаяАмортизация;
			Движение.Подразделение	=Выборка.Подразделение;
			Движение.СтатьяЗатрат	=Выборка.СтатьяЗатрат;
			
			//ЗАТАРАТЫ
			Движение=Движения.Затраты.Добавить();
			
			Движение.Период=Дата;
			Движение.ВидДвижения	=ВидДвиженияНакопления.Приход;
			
			Движение.Подразделение	=Выборка.Подразделение;
			Движение.СтатьяЗатрат	=Выборка.СтатьяЗатрат;		
			
			Движение.СуммаУпр		=РасчетнаяАмортизация;			
			
			Движение.СуммаДокумента	=РасчетнаяАмортизация;			
			Движение.ВалютаДокумента=ПараметрыСеанса.ВалютаУпр_2009;	
			Движение.ДатаЗаписи		=ТекущаяДата();
		КонецЕсли; 
	КонецЦикла;	
КонецПроцедуры
